# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors: 3

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, mobilenetv3_small_100, [True]], # 4
   [-1, 1, SPPF, [1024, 5]],  # 5
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 6
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 7
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4 8
   [-1, 3, C2f_Faster, [512, False]],  # 9   5

   [-1, 1, Conv, [256, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 12
   [-1, 3, C2f_Faster, [256, False]],  # 13 (P3/8-small)  9

   [-1, 1, Conv, [128, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 1], 1, Concat, [1]],  # 16 cat backbone P2
   [-1, 1, C2f_Faster, [128, False]],  # 17 (P2/4-xsmall) 13

   [-1, 1, Conv, [128, 3, 2]], # 18
   [[-1, 14], 1, Concat, [1]],  # cat head P3 19
   [-1, 3, C2f_Faster, [256, False]],  # 20 (P3/8-small)  16

   [-1, 1, Conv, [256, 3, 2]], # 21
   [[-1, 10], 1, Concat, [1]],  # cat head P4 22
   [-1, 3, C2f_Faster, [512, False]],  # 23 (P4/16-medium)  19

   [-1, 1, Conv, [512, 3, 2]], # 24
   [[-1, 6], 1, Concat, [1]],  # cat head P5 25
   [-1, 3, C2f_Faster, [1024, False]],  # 26 (P5/32-large)  22

   [[17, 20, 23, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]